app/controllers/posts_controller.rb

  def create
  @this_post = Post.new(post_params)

    if @this_post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdf"], ["body", "asdfasdf"], ["created_at", "2015-09-10 23:33:49.557287"], ["updated_at", "2015-09-10 23:33:49.557287"]]

  def show
    @this_post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]